Revit 2024 API
DuplicateTypeNamesHandlerArgs Properties
The DuplicateTypeNamesHandlerArgs type exposes the following members.
Properties
Name | Description
Document
 The document that contains the types with duplicate names.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace